In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

## Course comment stats

In [2]:
import json
import pandas as pd

file_name = 'course_translated.json'

with open(file_name, 'r', encoding='utf-8') as file:
    data = json.load(file)

# Convert the list of dictionaries to a DataFrame
course = pd.DataFrame(data)

# Display the first few rows using .head()
course.head()

,id,name,field,prerequisites,about,resource
0,C_584313,"introduction to ""zi zhi tong jian""","['history', 'chinese language and literature']",,"through the teacher's guidance, students can g...","[{'titles': ['第一课 导论与三家分晋', '导论', '导论'], 'reso..."
1,C_584329,calculus - limit theory and functions of one v...,"['applied economics', 'mathematics', 'physics'...",,this course is a basic mathematics course in s...,"[{'titles': ['序言', '序言', '序言'], 'resource_id':..."
2,C_584381,photojournalism,"['art', 'journalism']",,"master basic photography skills, understand ho...","[{'titles': ['第一章 绪论', '第一讲 引言1', '引言1'], 'res..."
3,C_597208,data mining: theory and algorithms,['computer science and technology'],,the most interesting theory + the most useful ...,"[{'titles': ['走进数据科学：博大精深，美不胜收', '整装待发', 'Vide..."
4,C_597225,university computer,[],,university computer courses will be guided by ...,"[{'titles': ['第1周： 基于计算机的问题求解', '课程介绍', '开篇'],..."

In [3]:
user = pd.read_json('user.json',lines=True)

In [4]:
user.head()

,id,name,gender,school,year_of_birth,course_order,enroll_time
0,U_22,我,0.0,,2015.0,"[682129, 2294668]","[2019-10-12 10:28:02, 2020-11-21 14:03:28]"
1,U_24,王帅国,1.0,清华大学,6558.0,"[597214, 605512, 597211, 597314, 597208, 62950...","[2019-05-20 16:06:48, 2019-05-24 19:34:43, 201..."
2,U_25,王帅国,0.0,清华大学,NaN,[1903985],[2020-08-07 18:59:13]
3,U_53,于歆杰,1.0,清华大学,1973.0,"[696679, 1704639, 943255, 1729417, 682164, 177...","[2020-03-01 21:24:30, 2020-03-12 16:17:02, 202..."
4,U_54,马昱春,2.0,清华大学,NaN,"[682442, 682164, 1748240, 1778890, 1829031, 17...","[2019-10-09 02:17:49, 2019-11-08 00:49:03, 202..."

In [5]:
all_courses = []

for courses in user['course_order']:
    all_courses.extend(courses)

from collections import Counter
course_counts = Counter(all_courses)

course_df = pd.DataFrame(list(course_counts.items()), columns=['course_id', 'num_users'])

In [6]:
course_df['course_id'] = course_df['course_id'].apply(lambda x: f'C_{x}')

In [7]:
course_df

      course_id  num_users
0      C_682129       4444
1     C_2294668        363
2      C_597214         12
3      C_605512         13
4      C_597211          7
...         ...        ...
4696  C_2275456          1
4697  C_2321310          1
4698  C_2334325          1
4699  C_2220132          1
4700  C_2221821          1

[4701 rows x 2 columns]

In [10]:
merged_course_df = pd.merge(course, course_df, left_on='id', right_on='course_id', how='left')

In [12]:
selected_columns_df = merged_course_df[['id', 'name', 'num_users']]

In [14]:
selected_columns_df

             id                                               name  num_users
0      C_584313                 introduction to "zi zhi tong jian"          3
1      C_584329  calculus - limit theory and functions of one v...          6
2      C_584381                                    photojournalism          5
3      C_597208                 data mining: theory and algorithms         10
4      C_597225                                university computer          8
...         ...                                                ...        ...
3776  C_2338076                (wind project) software engineering          1
3777  C_2341259   (wind project) object-oriented programming (c++)          1
3778  C_2337996             (wind project) data structure (part 2)          1
3779  C_1945689                          machine learning bootcamp        184
3780  C_2329163                 creative writing practice tutorial          2

[3781 rows x 3 columns]

In [8]:
### selected_columns_df.to_csv('course_NumUserWithCourseName.csv', index=False)
### course_df.to_csv('course_User.csv', index=False)